{
  "aboutme": {
    "title": "ERIC BILAVER",
    "description": "currently looking for co-op/intern work this Fall.\n\nreach out if you do something cool",
    "lists": [
      {
        "name": "THINGS I DO",
        "description": "Front-End\n     React\n     Vue\n     Three.JS\nBack-End\n     C(++)\n     Golang"
      },
      {
        "name": "LET'S TALK"
      }
    ]
  },
  "work": [
    {
      "name": "Mero1",
      "color": "#ff6629",
      "logo": "/images/Mero.png",
      "link": "",
      "title": "Junior Implementation Specialist",
      "company": "Mero",
      "location": "Toronto, ON",
      "dates": "Feb 2020 - Apr 2020",
      "desc": [
        "• Monitored product stock by designing a custom storage tracking app while also working with distributors to decrease manufacturing costs over 40%",
        "• Designed and created bi-weekly and quarterly business reports for clients",
        "• Participated in IoT product deployments in 10+ buildings across the GTA with a small team"
      ]
    },
    {
      "name": "Mero2",
      "color": "#ff6629",
      "logo": "/images/Mero.png",
      "link": "",
      "title": "Senior Implementation Specialist",
      "company": "Mero",
      "location": "Toronto, ON",
      "dates": "Aug 2020 - Dec 2020",
      "desc": [
        "• Coordinated and managed product deployment of 1500 sensors at over 20 buildings across Canada and the United Kingdom",
        "• Performed quality assurance on over 200 IoT LoRa receivers and 100 sensors using the Arduino IDE to assist in product rollout",
        "• Produced bi-weekly and quarterly client-facing business reports in Figma, met with extremely positive feedback on design",
        "• Helped refactor existing product network contracts to streamline company services which reduced fees by over $500/month"
      ]
    },
    {
      "name": "AHead",
      "color": "#004976",
      "logo": "/images/AHead.png",
      "link": "",
      "title": "Developer Intern",
      "company": "AHead Simulations",
      "location": "Cambridge, ON",
      "dates": "May 2021 - Aug 2021",
      "desc": [
        "• Designed and implemented Vue components and Python scripts for an audiology training platform (CARL)",
        "• Configured, tested, and troubleshot various low-level protocols (I2S, I2C, SPI) on the Jetson Nano system",
        "• Soldered SMD components and collaborated with team members to test various PCB boards",
        "• Wrote documentation and workflows for hardware, software, boot protocols, and future interns",
        "• Contributed to software production planning and project management for future product launch"
      ]
    },
    {
      "name": "1Password",
      "color": "#0572EC",
      "logo": "/images/1P.png",
      "link": "https://1password.com/",
      "title": "Junior Developer (Billing)",
      "company": "1Password",
      "location": "Toronto, ON",
      "dates": "Jan 2022 - Apr 2022",
      "desc": [
        "• Worked with senior developers to re-architect billing process into a single payment window facing $120M+ in annual sales",
        "• Assisted in creating RESTful APIs that connect front-end React code to back-end Go code to service over 90,000 business customers' billing requests",
        "• Tested code and solved bugs throughout codebase, reducing code bloat and improving overall performance",
        "• Refactored billing team intern documentation to better summarize all business terms and processes into an easy-to-read document"
      ]
    },
    {
      "name": "JAM3",
      "logo": "/images/JAM3.png",
      "color": "#292929",
      "link": "https://www.jam3.com/",
      "title": "Developer Intern",
      "company": "JAM3",
      "location": "Toronto, ON",
      "dates": "Jan 2023 - Apr 2023",
      "desc": [
        "• Created components and implemented API calls with an experienced team in React for Shopify’s Entrepreneurship Index webpage",
        "• Worked with Three.JS and WebGL to create a company art piece displayed on their website",
        "• Recreated a past client site using a Next.js framework to research usability and performance, which was used to create the company-wide boilerplate"
      ]
    },
    {
      "name": "Indigo",
      "color": "#2a2d93",
      "logo": "/images/Indigo2.png",
      "link": "https://www.indigo.ca/",
      "title": "Android Developer / Project Manager",
      "company": "Indigo Inc.",
      "location": "Toronto, ON",
      "dates": "Sept 2023 - Dec 2023",
      "desc": [
        "• Independently architected in-store Search Kiosk software using Kotlin/Android for use in 200+ stores across Canada",
        "• Worked as project lead and created CI/CD and testing frameworks to improve efficiency by 20+%",
        "• TBA, Still Working!"
      ]
    }
  ],
  "projects": [
    {
      "name": "FYDP",
      "logo": "/images/WWW.png",
      "link": "https://github.com/who-wat-where",
      "title": "FYDP - Who? WAT? Where?",
      "dates": "May 2023 - April 2024",
      "desc": [
        "• Developed a React Native application to serve as an all-in-one student accessory, offering door-to-door navigation, campus information, and custom user recommendations",
        "• Designed and implemented an interactive 360° panorama “Street View” component with Three.js, connected backend and frontend code, and created user facing components"
      ]
    },
    {
      "name": "MunchBox",
      "logo": "/images/MunchBox.png",
      "link": "https://github.com/rseln/MunchBox",
      "title": "ECE 452 - MunchBox",
      "dates": "May 2023 - April 2024",
      "desc": [
        "• Worked in a team of 6 to create a “tiffin” food ordering application using Kotlin and Android Compose",
        "• Added image upload functionality, backend API connections, and developed front end components"
      ]
    },
    {
      "name": "website2.0",
      "logo": "/images/Website.png",
      "link": "http://ericbilaver.com/",
      "title": "Portfolio Site 2.0",
      "dates": "May 2023",
      "desc": [
        "• Redesigned original portfolio site from the ground up to display new talents and work",
        "• Architected site using React, Next.js, and Vercel",
        "• Designed and created interactive Three.JS models on site to display new working talent with the technology"
      ]
    },
    {
      "name": "deltahacks",
      "logo": "/images/Delta.png",
      "link": "https://devpost.com/software/quil",
      "title": "Deltahacks 2021 (Quil)",
      "dates": "Mar 2021",
      "desc": [
        "• Created a productivity site to that serves as an 'all-in-one' project manager, to-do list, and effective note-taking software ('Quil')",
        "• Collaborated with 4 friends over a 36 hour period to develop a functioning React.js site with a CKEditor implementation",
        "• Worked on front-end development as well as logo design using Figma"
      ]
    },
    {
      "name": "website1.0",
      "logo": "",
      "link": "",
      "title": "Portfolio Site 1.0",
      "dates": "Feb 2021",
      "desc": [
        "• Made my first hosted website using Gatsby and GitHub Pages",
        "• Designed pages and components using Figma",
        "• Secured site using HTTPS"
      ]
    },

    {
      "name": "HTN",
      "logo": "/images/HTN.png",
      "link": "https://devpost.com/software/hack-the-north-2020-04oqxr",
      "title": "Hack The North 2020",
      "dates": "Jan 2021",
      "desc": [
        "• Worked in a team of 4 to create an exercise-focused social media site with JavaScript, (S)CSS, and HTML in response to COVID-19 limitations ('VideoGym') over a 36 hour period",
        "• Implemented the Vonage Video API to create a global video calling system; received positive feedback from official Vonage representative"
      ]
    },
    {
      "name": "ECOO",
      "logo": "",
      "link": "",
      "title": "ECOO Programming Contest",
      "dates": "May 2019",
      "desc": [
        "• Collaborated with 3 team members to place first in the Halton region by programming solutions to complex computational problems"
      ]
    },
    {
      "name": "GoogleRPI",
      "logo": "",
      "link": "",
      "title": "Raspberry Pi Google Assistant",
      "dates": "Jan 2018",
      "desc": [
        "• Implemented a working model of the Google Assistant API into a Raspberry Pi with working microphone, speaker, and visual display peripherals to create an ultra-cost-effective “Google Nest Hub”"
      ]
    },
    {
      "name": "NDSTEAM",
      "logo": "",
      "link": "",
      "title": "S.T.E.A.M. (STEM & Arts) Club",
      "dates": "Sept 2017 - Jun 2019",
      "desc": [
        "• Independently created webpages using HTML, JavaScript, and CSS to advertise the school’s S.T.E.A.M. programs, initiatives, and show real-time data from the IoT-connected greenhouse",
        "• Effectively collaborated with over 100 students to create a functioning web-connected greenhouse from scratch"
      ]
    }
  ],
  "contact": {}
}
